---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCImportIntent.Reference
enum: Autodesk.Revit.DB.IFC.IFCImportIntent
source: html/07dbaa65-98da-4403-7c19-c234246584ba.htm
---
# Autodesk.Revit.DB.IFC.IFCImportIntent.Reference

Imports the IFC file to serve as a reference (lightweight and accurate representations will be constructed, but they cannot be edited as standard Revit elements).